src/main/test/supply-chain/5-Smoke Tests/4-CR COMPASS (TIM Base)/0-IKEA Goods - RIX/1-TC_06.07_BUC,BUT,TRN,TRT_fill/0-GetTaxRegistrationNumber/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tax="http://taxreg.basedata.ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <tax:getTaxRegistration>
         <!--Optional:-->
         <arg0>
            <SourceSystemId>ICI001</SourceSystemId>
            <!--Optional:-->
            <BusinessUnit>
               <BusinessUnitCode>5100</BusinessUnitCode>
               <BusinessUnitType>COM</BusinessUnitType>
            </BusinessUnit>
            <!--Optional:-->
            <GeographicalArea>
               <GeographicalAreaCode/>
               <GeographicalAreaType/>
            </GeographicalArea>
            <!--Optional:-->
            <TaxRegistrationNumber>
               <TaxRegistrationNumber>CHE 116267532MWST</TaxRegistrationNumber>
               <TaxRegistrationType>DV</TaxRegistrationType>
            </TaxRegistrationNumber>
            <Date>2014-06-01</Date>
            <!--Zero or more repetitions:-->
            
         </arg0>
      </tax:getTaxRegistration>
   </soap:Body>
</soap:Envelope>